[
  {
    "id": 1,
    "Title": "Point Of Sale System",
    "Description": "C# Project (Individual)",
    "Img": "csharpp.jpg",
    "Link": "https://youtu.be/-GqhJ5CbBoA?si=3IgEO0nvoAr4c4mZ",
    "Github": "https://github.com/Sahandulmith/GUI-Application",
    "TechStack": ["C#", "SQL Server", ".Net"],
    "Features": ["Admin User Login", "Income Report View", "Send Email and GSM Moderm Use Send SMS"]
  },
  {
    "id": 2,
    "Title": "E-Commerce Web Site",
    "Description": "Project Based on HTML,CSS,Js (Individual)",
    "Img": "html css.jpg",
    "Link": "https://youtu.be/3j4SF0fYYTM?si=5C4edcPWFz0KGkqd",
    "Github": "https://github.com/Sahandulmith/HTML-Project",
    "TechStack": ["HTML", "CSS", "Bootstrap", "JavaScript", "JQuery", "PHP", "MySQL"],	
    "Features": ["User-Friendly Interface Seamless navigation and engaging design","Secure Transactions: Robust security measures to protect user data.",
                  "Responsive Design: Optimized for all devices, ensuring a great experience on mobile, tablet, and desktop.",
                  "Dynamic Content: Real-time product updates and interactive features.",
                  "Advanced Search and Filtering: Easily find products with a powerful search and filter system.",
                  "User Accounts: Secure user registration, login, and profile management.",
                  "Shopping Cart: Simple and intuitive cart system for adding, removing, and viewing items.",
                  "Product Reviews and Ratings: Customers can leave reviews and ratings for products.",
                  "Multiple Payment Options ", "Send Email and GSM Moderm Use Send SMS"]
  },
  {
    "id": 3,
    "Title": "Point Of Sale System",
    "Description": "Java Project (Individual)",
    "Img": "java.jpg",
    "Link": "https://youtu.be/4hB7ECNBcLY?si=Kx6ozHwxFqo3vuFG",
    "Github": "https://github.com/Sahandulmith/JAVA-EAD1",
    "TechStack": ["Java", "MySQL", "Jasper Report"],
    "Features": ["User Photo Registration 📸: Easily register users with photo uploads to personalize their profiles.",
                  "Email Verification ✅: Ensuring security and authenticity with a robust email verification system.",
                  "OTP Sending 🔐: Added security through one-time password functionality for sensitive transactions.",
                  "Bill Details 💼: Comprehensive views and management of billing information.",
                  "Sales Reports 📊: Generate detailed sales reports to track performance and insights.", "Send Email and GSM Moderm Use Send SMS"]
  },
  {
    "id": 4,
    "Title": "Vating System",
    "Description": "Project Based on PHP (Individual)",
    "Img": "php.jpg",
    "Link": "https://youtu.be/03Rv1aYcAHY?si=RZFmUTWyM9LnYi4J",
    "Github": "https://github.com/Sahandulmith/Voting-System",
    "TechStack": ["PHP", "MySQL", "Bootstrap", "JavaScript", "JQuery"],
    "Features": [ "🔒 Secure Voter Registration: When a voter registers, they instantly receive an email with their unique voter ID and password, ensuring a smooth and secure voting experience.",
                  "🔍 Voter Verification: Voters can verify their registration status and eligibility to vote by entering their voter ID and password.",
                  "📧 Automated Email Notifications: In addition to receiving login credentials, voters are notified at each stage of the process, including registration confirmation and voting success.",
                  "📊 Real-Time Vote Counting: The system provides real-time results as votes are cast, ensuring transparency and accuracy in the election process.",
                  "👤 Admin Dashboard: Administrators have access to an intuitive dashboard for managing voters, tracking activity, and viewing detailed election reports.",
                  "📱 Mobile-Responsive Design: Voters can easily access the platform from any device—whether on desktop, tablet, or smartphone—for a seamless experience.",
                  "🔑 Two-Factor Authentication : Added an extra layer of security with 2FA to safeguard the integrity of the voting process."]
  },
  {
    "id": 5,
    "Title": "System for Marking Attendance",
    "Description": "Face Recognize (Individual)",
    "Img": "python.jpg",
    "Link": "https://youtu.be/z6dy76Ie7E8?si=m85p2_mNq0gclcY1",
    "Github": "https://github.com/Sahandulmith/PYTHON",
    "TechStack": ["Python", "MySQL", "OpenCV", "Dlib", "Face Recognition"],
    "Features": ["Face Detection: Detects faces in real-time using OpenCV and Dlib libraries.",
                  "Face Recognition: Recognizes faces based on pre-trained models and stored data.",
                  "Attendance Marking: Automatically marks attendance when a recognized face is detected.",
                  "Database Management: Stores and manages attendance data in a MySQL database.",
                  "User-Friendly Interface: Simple and intuitive interface for easy interaction and management.",
                  "Real-Time Updates: Provides real-time updates on attendance status and reports."]
  },
  {
    "id": 6,
    "Title": "Smart Villa",
    "Description": "Electronic Project (Group)",
    "Img": "villa.jpg",
    "Link": "https://youtu.be/qE5lGSX1hIU?si=2U3jDgXdKTnJDKT0",
    "Github": "",
    "TechStack": ["Electronic"],
    "Features": ["Smart Home Automation: Control lights, fans, and other appliances remotely using a mobile app.",
                  "Security System: Monitor and control security cameras, alarms, and door locks from anywhere.",
                  "Energy Management: Optimize energy consumption by remotely controlling appliances and monitoring usage.",
                  "Temperature Control: Adjust room temperature and climate settings for comfort and energy efficiency.",
                  "Voice Control: Use voice commands to control smart devices and systems for hands-free operation.",
                  "Real-Time Monitoring: Receive alerts and notifications for security breaches, energy usage, and system status."]
  },
  {
    "id": 7,
    "Title": "Portfolio Website",
    "Description": "Project Based on React (Individual)",
    "Img": "react.png",
    "Link": "https://sahandulmith.github.io/Portfolio-Website/",
    "Github": "https://github.com/Sahandulmith/Portfolio-Website",
    "TechStack": ["React","EmailJS","CSS"],
    "Features": ["Responsive Design: Optimized for all devices, ensuring a great experience on mobile, tablet, and desktop.",
                  "Portfolio Showcase: Display projects, skills, and achievements in an organized and visually appealing manner.",
                  "Contact Form: Allow visitors to send messages and inquiries directly through the website.",
                  "Interactive Elements: Engage users with interactive elements like animations, transitions, and hover effects.",
                  "SEO Optimization: Implement SEO best practices to improve visibility and search engine rankings.",
                  "Social Media Integration: Connect with visitors through social media links and sharing options."]
  },
  {
    "id": 8,
    "Title": "Adopt A Wallet",
    "Description": "Flutter Project (Group)",
    "Img": "adopt.jpg",
    "Link": "https://youtu.be/cxJH09zuc_w?si=dFKym4a0ZrV0N0EK",
    "Github": "https://github.com/Sahandulmith/FLUTTER-PROJECT-Financial-Manager-App",
    "TechStack": ["Flutter","Firebase","Dart"],
    "Features": ["Expense Tracking: Monitor and categorize expenses to track spending habits and budgeting.",
                  "Income Management: Record and analyze income sources for financial planning and management.",
                  "Budget Planning: Set budgets and financial goals to achieve savings and reduce overspending.",
                  "Bill Reminders: Receive notifications and reminders for upcoming bills and payments.",
                  "Financial Reports: Generate detailed reports and insights on income, expenses, and savings.",
                  "Secure Authentication: Ensure data security with user authentication and access control.",
                  "Cloud Storage: Store and sync data across devices using Firebase cloud storage."]
  },
  {
    "id": 9,
    "Title": "Portfolio Website",
    "Description": "Project Based on React",
    "Img": "technoid.png",
    "Link": "https://technoidt.netlify.app/",
    "Github": "https://github.com/Sahandulmith/TECHNOID",
    "TechStack": ["React", "Next.js","Node.js","Tailwind CSS"],
    "Features": ["Responsive Design: Optimized for all devices, ensuring a great experience on mobile, tablet, and desktop.",
                  "Portfolio Showcase: Display projects, skills, and achievements in an organized and visually appealing manner.",
                  "Contact Form: Allow visitors to send messages and inquiries directly through the website.",
                  "Interactive Elements: Engage users with interactive elements like animations, transitions, and hover effects.",
                  "SEO Optimization: Implement SEO best practices to improve visibility and search engine rankings.",
                  "Social Media Integration: Connect with visitors through social media links and sharing options."]
  }
]